[
    {
  "company": "Infosys",
  "role": "Software Engineer",
  "client": "CMA CGM",
  "project": "AQUA – Freight Quotation Digitization Platform",
  "location": "Pune, India",
  "startDate": "2020-10",
  "endDate": "2022-08",
  "description": "Digitized the freight quotation process for CMA CGM by developing a modern web application from scratch using Angular and PrimeNG, significantly improving efficiency and user experience.",
  "achievements": [
    "Developed a freight quotation generation system from the ground up using Angular and PrimeNG, reducing quotation processing time by 70% by replacing the legacy manual process for booking freight and ships.",
    "Developed the user interface from scratch using Angular and PrimeNG, resulting in a more efficient and user-friendly experience.",
    "Wrote unit and integration test cases using Jasmine and Karma to ensure high-quality, bug-free releases.",
    "Received Infosys Insta Award for outstanding contribution to the development and successful release of the AQUA MVP.",
    "Provided post-launch support, resolving production issues and ensuring smooth operations during the MVP’s initial adoption phase.",
    "Contributed to incremental feature updates and enhancements post-MVP, improving system performance, usability, and customer satisfaction."
  ],
  "technologies": [
    "Angular",
    "PrimeNG",
    "HTML5",
    "CSS3",
    "TypeScript",
    "JavaScript",
    "Jasmine",
    "Karma"
  ]
},
{
    "company": "3Pillar Global Pvt Ltd",
    "position": "Senior Software Engineer",
    "client": "Cisco",
    "project": "Cisco SCC (Security Cloud Control)",
    "startDate": "[Start Date]",
    "endDate": "Present",
    "description": "Led the modernization of Cisco's flagship security platform, migrating a legacy codebase to a modern tech stack. Implemented advanced state management and testing frameworks, significantly improving application performance and user experience.",
    "responsibilities": [
      "Spearheaded the front-end modernization of Cisco's Security Cloud Control (SCC) platform, leading a migration from a legacy AngularJS codebase to Angular 15.",
      "Improvised and implemented a new UI, adhering to Cisco's Magnetic Designs UI library and web design policies.",
      "Implemented a robust state management solution using the Facade Observer pattern with NgRx and RxJS, which transformed the application into a Single-Page Application (SPA) and significantly improved loading speeds and user experience.",
      "Authored and executed comprehensive unit, integration, and end-to-end tests using Jest and Cypress to ensure code quality and application stability.",
      "Collaborated with cross-functional teams to resolve critical user-reported bugs, leading to a successful migration with positive end-user feedback.",
      "Mentored and supported other development teams, providing guidance on integration testing and understanding complex code flows."
    ],
    "technologies": [
      "Angular 15",
      "Nx",
      "NgRx",
      "RxJS",
      "Jest",
      "Cypress",
      "HTML5",
      "CSS3",
      "TypeScript",
      "AngularJS"
    ]
  }

]